zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/rtl87x2g-pinctrl.h
/* Port 1 */
/* Note: P1_0/P1_1 default to SWD function for rtl87x2g. */
#define BEE_PSEL_GPIOA_8_P1_0  BEE_PSEL(DWGPIO, P1_0) /**< GPIOA_8 for P1_0 */
#define BEE_PSEL_GPIOA_9_P1_1  BEE_PSEL(DWGPIO, P1_1) /**< GPIOA_9 for P1_1 */
#define BEE_PSEL_GPIOA_10_P1_2 BEE_PSEL(DWGPIO, P1_2) /**< GPIOA_10 for P1_2 */
#define BEE_PSEL_GPIOA_11_P1_3 BEE_PSEL(DWGPIO, P1_3) /**< GPIOA_11 for P1_3 */
#define BEE_PSEL_GPIOA_12_P1_4 BEE_PSEL(DWGPIO, P1_4) /**< GPIOA_12 for P1_4 */
#define BEE_PSEL_GPIOA_13_P1_5 BEE_PSEL(DWGPIO, P1_5) /**< GPIOA_13 for P1_5 */
#define BEE_PSEL_GPIOA_14_P1_6 BEE_PSEL(DWGPIO, P1_6) /**< GPIOA_14 for P1_6 */
#define BEE_PSEL_GPIOA_15_P1_7 BEE_PSEL(DWGPIO, P1_7) /**< GPIOA_15 for P1_7 */

/* Port 2 */
#define BEE_PSEL_GPIOA_21_P2_0 BEE_PSEL(DWGPIO, P2_0) /**< GPIOA_21 for P2_0 */
#define BEE_PSEL_GPIOA_22_P2_1 BEE_PSEL(DWGPIO, P2_1) /**< GPIOA_22 for P2_1 */
#define BEE_PSEL_GPIOA_23_P2_2 BEE_PSEL(DWGPIO, P2_2) /**< GPIOA_23 for P2_2 */
#define BEE_PSEL_GPIOA_24_P2_3 BEE_PSEL(DWGPIO, P2_3) /**< GPIOA_24 for P2_3 */
#define BEE_PSEL_GPIOA_25_P2_4 BEE_PSEL(DWGPIO, P2_4) /**< GPIOA_25 for P2_4 */
#define BEE_PSEL_GPIOA_26_P2_5 BEE_PSEL(DWGPIO, P2_5) /**< GPIOA_26 for P2_5 */
#define BEE_PSEL_GPIOA_27_P2_6 BEE_PSEL(DWGPIO, P2_6) /**< GPIOA_27 for P2_6 */
#define BEE_PSEL_GPIOA_28_P2_7 BEE_PSEL(DWGPIO, P2_7) /**< GPIOA_28 for P2_7 */

/* Port 3 */
#define BEE_PSEL_GPIOA_29_P3_0 BEE_PSEL(DWGPIO, P3_0) /**< GPIOA_29 for P3_0 */
#define BEE_PSEL_GPIOA_30_P3_1 BEE_PSEL(DWGPIO, P3_1) /**< GPIOA_30 for P3_1 */
#define BEE_PSEL_GPIOA_31_P3_2 BEE_PSEL(DWGPIO, P3_2) /**< GPIOA_31 for P3_2 */
#define BEE_PSEL_GPIOB_0_P3_3  BEE_PSEL(DWGPIO, P3_3) /**< GPIOB_0 for P3_3 */
#define BEE_PSEL_GPIOB_1_P3_4  BEE_PSEL(DWGPIO, P3_4) /**< GPIOB_1 for P3_4 */
#define BEE_PSEL_GPIOB_2_P3_5  BEE_PSEL(DWGPIO, P3_5) /**< GPIOB_2 for P3_5 */
#define BEE_PSEL_GPIOB_3_P3_6  BEE_PSEL(DWGPIO, P3_6) /**< GPIOB_3 for P3_6 */
#define BEE_PSEL_GPIOB_4_P3_7  BEE_PSEL(DWGPIO, P3_7) /**< GPIOB_4 for P3_7 */

/* Port 4 */
#define BEE_PSEL_GPIOB_5_P4_0  BEE_PSEL(DWGPIO, P4_0) /**< GPIOB_5 for P4_0 */
#define BEE_PSEL_GPIOB_6_P4_1  BEE_PSEL(DWGPIO, P4_1) /**< GPIOB_6 for P4_1 */
#define BEE_PSEL_GPIOB_7_P4_2  BEE_PSEL(DWGPIO, P4_2) /**< GPIOB_7 for P4_2 */
#define BEE_PSEL_GPIOB_8_P4_3  BEE_PSEL(DWGPIO, P4_3) /**< GPIOB_8 for P4_3 */
#define BEE_PSEL_GPIOB_9_P4_4  BEE_PSEL(DWGPIO, P4_4) /**< GPIOB_9 for P4_4 */
#define BEE_PSEL_GPIOB_10_P4_5 BEE_PSEL(DWGPIO, P4_5) /**< GPIOB_10 for P4_5 */
#define BEE_PSEL_GPIOB_11_P4_6 BEE_PSEL(DWGPIO, P4_6) /**< GPIOB_11 for P4_6 */
#define BEE_PSEL_GPIOB_12_P4_7 BEE_PSEL(DWGPIO, P4_7) /**< GPIOB_12 for P4_7 */

/* Port 5 */
#define BEE_PSEL_GPIOB_13_P5_0 BEE_PSEL(DWGPIO, P5_0) /**< GPIOB_13 for P5_0 */
#define BEE_PSEL_GPIOB_14_P5_1 BEE_PSEL(DWGPIO, P5_1) /**< GPIOB_14 for P5_1 */
#define BEE_PSEL_GPIOB_15_P5_2 BEE_PSEL(DWGPIO, P5_2) /**< GPIOB_15 for P5_2 */
#define BEE_PSEL_GPIOB_16_P5_3 BEE_PSEL(DWGPIO, P5_3) /**< GPIOB_16 for P5_3 */
#define BEE_PSEL_GPIOB_17_P5_4 BEE_PSEL(DWGPIO, P5_4) /**< GPIOB_17 for P5_4 */
#define BEE_PSEL_GPIOB_18_P5_5 BEE_PSEL(DWGPIO, P5_5) /**< GPIOB_18 for P5_5 */
#define BEE_PSEL_GPIOB_19_P5_6 BEE_PSEL(DWGPIO, P5_6) /**< GPIOB_19 for P5_6 */
#define BEE_PSEL_GPIOB_20_P5_7 BEE_PSEL(DWGPIO, P5_7) /**< GPIOB_20 for P5_7 */

/* Port 6 */
#define BEE_PSEL_GPIOB_19_P6_0 BEE_PSEL(DWGPIO, P6_0) /**< GPIOB_19 for P6_0 */
#define BEE_PSEL_GPIOB_20_P6_1 BEE_PSEL(DWGPIO, P6_1) /**< GPIOB_20 for P6_1 */
#define BEE_PSEL_GPIOB_21_P6_2 BEE_PSEL(DWGPIO, P6_2) /**< GPIOB_21 for P6_2 */
#define BEE_PSEL_GPIOB_22_P6_3 BEE_PSEL(DWGPIO, P6_3) /**< GPIOB_22 for P6_3 */
#define BEE_PSEL_GPIOB_23_P6_4 BEE_PSEL(DWGPIO, P6_4) /**< GPIOB_23 for P6_4 */
#define BEE_PSEL_GPIOB_24_P6_5 BEE_PSEL(DWGPIO, P6_5) /**< GPIOB_24 for P6_5 */
#define BEE_PSEL_GPIOB_25_P6_6 BEE_PSEL(DWGPIO, P6_6) /**< GPIOB_25 for P6_6 */
#define BEE_PSEL_GPIOB_26_P6_7 BEE_PSEL(DWGPIO, P6_7) /**< GPIOB_26 for P6_7 */

/* Port 7 */
#define BEE_PSEL_GPIOB_27_P7_0 BEE_PSEL(DWGPIO, P7_0) /**< GPIOB_27 for P7_0 */
#define BEE_PSEL_GPIOB_28_P7_1 BEE_PSEL(DWGPIO, P7_1) /**< GPIOB_28 for P7_1 */
#define BEE_PSEL_GPIOB_29_P7_2 BEE_PSEL(DWGPIO, P7_2) /**< GPIOB_29 for P7_2 */
#define BEE_PSEL_GPIOB_30_P7_3 BEE_PSEL(DWGPIO, P7_3) /**< GPIOB_30 for P7_3 */
#define BEE_PSEL_GPIOB_31_P7_4 BEE_PSEL(DWGPIO, P7_4) /**< GPIOB_31 for P7_4 */

/* Special Functions / Port 8 Equivalent */
/* Note: Using P8_x extracted from comments */
#define BEE_PSEL_GPIOA_16_P8_0 BEE_PSEL(DWGPIO, MICBIAS) /**< GPIOA_16 for P8_0 */
#define BEE_PSEL_GPIOA_17_P8_1 BEE_PSEL(DWGPIO, XI32K)   /**< GPIOA_17 for P8_1 */
#define BEE_PSEL_GPIOA_18_P8_2 BEE_PSEL(DWGPIO, XO32K)   /**< GPIOA_18 for P8_2 */
#define BEE_PSEL_GPIOA_19_P8_3 BEE_PSEL(DWGPIO, DACP)    /**< GPIOA_19 for P8_3 */
#define BEE_PSEL_GPIOA_20_P8_4 BEE_PSEL(DWGPIO, DACN)    /**< GPIOA_20 for P8_4 */

/* Port 9 */
#define BEE_PSEL_GPIOB_21_P9_0 BEE_PSEL(DWGPIO, P9_0) /**< GPIOB_21 for P9_0 */
#define BEE_PSEL_GPIOB_22_P9_1 BEE_PSEL(DWGPIO, P9_1) /**< GPIOB_22 for P9_1 */
#define BEE_PSEL_GPIOB_23_P9_2 BEE_PSEL(DWGPIO, P9_2) /**< GPIOB_23 for P9_2 */
#define BEE_PSEL_GPIOB_24_P9_3 BEE_PSEL(DWGPIO, P9_3) /**< GPIOB_24 for P9_3 */
#define BEE_PSEL_GPIOB_25_P9_4 BEE_PSEL(DWGPIO, P9_4) /**< GPIOB_25 for P9_4 */
#define BEE_PSEL_GPIOB_26_P9_5 BEE_PSEL(DWGPIO, P9_5) /**< GPIOB_26 for P9_5 */
#define BEE_PSEL_GPIOB_27_P9_6 BEE_PSEL(DWGPIO, P9_6) /**< GPIOB_27 for P9_6 */
#define BEE_PSEL_GPIOB_28_P9_7 BEE_PSEL(DWGPIO, P9_7) /**< GPIOB_28 for P9_7 */

/* Port 10 */
#define BEE_PSEL_GPIOB_29_P10_0 BEE_PSEL(DWGPIO, P10_0) /**< GPIOB_29 for P10_0 */
#define BEE_PSEL_GPIOB_30_P10_1 BEE_PSEL(DWGPIO, P10_1) /**< GPIOB_30 for P10_1 */
#define BEE_PSEL_GPIOB_31_P10_2 BEE_PSEL(DWGPIO, P10_2) /**< GPIOB_31 for P10_2 */

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_RTL87X2G_PINCTRL_H_ */
